СкладГП/src/InformationRegisters/НазначенныеПодсборки/НазначенныеПодсборки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НазначенныеПодсборки</name>
  <resources>
    <name>Место</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </resources>
  <attributes>
    <name>НомерСпецификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пакет</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СкладГП/src/InformationRegisters/ОстаткиПакетовНаСкладах/ОстаткиПакетовНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОстаткиПакетовНаСкладах</name>
  <resources>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Досок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ряд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СкладГП/src/InformationRegisters/СвойстваПакетов/СвойстваПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваПакетов</name>
  <resources>
    <name>Сечение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СечениеТолщина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СечениеШирина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ВидыПродукции</types>
    </type>
  </resources>
  <resources>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </resources>
  <resources>
    <name>ТипРаспила</name>
    <type>
      <types>CatalogRef.ТипыРаспила</types>
    </type>
  </resources>
  <resources>
    <name>ДлинаТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлинаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлинаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>CatalogRef.Влажности</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Досок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Порода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <comment>1 - ОК, 2 - Резерв, 3 - ЗапрещенаОтгрузка, 4 - Поврежден</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Партия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрефиксПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>БазаПУ</name>
    <type>
      <types>CatalogRef.БазыПУ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СкладГП/src/CommonForms/ФормаЗаданияНаВывозку/Module.bsl
&НаКлиенте
Процедура ПакетыСборкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	ТекДанные = Элементы.ПакетыСборки.ТекущиеДанные; 
	Если ТекДанные = Неопределено Тогда Возврат КонецЕсли;
	ОткрытьФорму("Обработка.ИнвентаризацияЯчейки.Форма.ФормаИнвентаризацииШтабеля", Новый Структура("Ячейка", ТекДанные.Ячейка), ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьПакетыСборки()
КонецПроцедуры

&НаСервере
Процедура ОбновитьПакетыСборки()
	ПакетыСборки.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НазначенныеПодсборки.Пакет КАК Пакет,
	|	ОстаткиПакетовНаСкладах.Ячейка КАК Ячейка,
	|	ОстаткиПакетовНаСкладах.Объем КАК Объем,
	|	ОстаткиПакетовНаСкладах.Досок КАК Досок,
	|	ОстаткиПакетовНаСкладах.Ряд КАК Ряд,
	|	ОстаткиПакетовНаСкладах.Уровень КАК Уровень,
	|	СвойстваПакетов.Сечение КАК Сечение,
	|	СвойстваПакетов.ДлинаТ КАК ДлинаТ,
	|	СвойстваПакетов.Порода КАК Порода,
	|	СвойстваПакетов.Номер КАК Номер,
	|	СвойстваПакетов.Сорт КАК Сорт,
	|	НазначенныеПодсборки.НомерСпецификации КАК НомерСпецификации,
	|	НазначенныеПодсборки.Покупатель КАК Покупатель,
	|	НазначенныеПодсборки.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.НазначенныеПодсборки КАК НазначенныеПодсборки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОстаткиПакетовНаСкладах КАК ОстаткиПакетовНаСкладах
	|		ПО НазначенныеПодсборки.Пакет = ОстаткиПакетовНаСкладах.НомерПакета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваПакетов КАК СвойстваПакетов
	|		ПО НазначенныеПодсборки.Пакет = СвойстваПакетов.НомерПакета
	|ГДЕ
	|	НазначенныеПодсборки.Место = &Место";
	Запрос.УстановитьПараметр("Место", Место);
	Выборка = Запрос.Выполнить().Выбрать();
	Первый = ИСТИНА;
	Пока Выборка.Следующий() Цикл
		Нов = ПакетыСборки.Добавить();
		Нов.Пакет = Выборка.Пакет;
		Нов.Номер = Выборка.Номер;
		Нов.Описание = ЯчейкиСклада.ОписаниеПакета(Нов.Пакет, Выборка);
		Нов.Адрес = ЯчейкиСклада.АдресПакета(Выборка.Ячейка, Выборка.Ряд, Выборка.Уровень);
		Нов.Ячейка = Выборка.Ячейка;
		Нов.Объем = Выборка.Объем;
		
		Если Первый Тогда
			ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка, "НомерСпецификации,Покупатель,Комментарий"); 
			ЭтаФорма.Заголовок = ""+НомерСпецификации+" ("+Покупатель+")";
			Первый = ЛОЖЬ;
		КонецЕсли;
		
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Место = Параметры.Место;
КонецПроцедуры
